/* ************************************************************************
 *       Filename:  13_有参无返回值函数的使用.c
 *    Description:  
 *        Version:  1.0
 *        Created:  2016年10月22日 17时01分42秒
 *       Revision:  none
 *       Compiler:  gcc
 *         Author:  YOUR NAME (), 
 *        Company:  
 * ************************************************************************/


#include <stdio.h>

//有参无返回值函数的定义
//1、定义函数的参数叫做形参，形参的格式必须为：类型+变量，不能赋值
//void fun1(int a = 10) //err
//2、函数没有调用，形参变量不会分配空间，函数调用完毕，形参变量自动释放
void fun1(int a)
{
	printf("a = %d\n", a);
}

//3、如果形参有多个，用逗号","分开
void fun2(int a, char ch, char buf[100])
{
	printf("a = %d, ch = %c, buf = %s\n", a, ch, buf);
}

int main(int argc, char *argv[])
{
	
	int a = 10;
	
	//有参无返回值函数的调用
	//1、如果函数定义是有参数，调用时必须传参
		//fun1(); //err
	//2、有参函数调用形式：函数名字(匹配类型参数)
	//3、匹配类型参数可以是变量、常量、表达式
	//4、函数调用时传的参数，叫实参
	//5、只能把实参的值传递给形参，不能反过来，单向传递
	
	
	fun1(10); //实参是常量
	
	int i = 11;
	fun1(i); //实参是变量
	
	fun1(1 > 2); //实参是表达式
	
	//6、函数的形参有多个，传参也用逗号","分开
	fun2(10, 'a', "hello");

	return 0;
}


